---
title: DocumentDifference
classe: Autodesk.Revit.DB.DocumentDifference
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# DocumentDifference

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean AreDeletedElementIdsAvailable { get; }` | `documentDifference.AreDeletedElementIdsAvailable` | Boolean |
| `Boolean IsValidObject { get; }` | `documentDifference.IsValidObject` | Boolean |
| `Void Dispose()` | `documentDifference.Dispose()` | Void |
| `ISet<ElementId> GetCreatedElementIds()` | `documentDifference.GetCreatedElementIds()` | ISet<ElementId> |
| `ISet<ElementId> GetDeletedElementIds()` | `documentDifference.GetDeletedElementIds()` | ISet<ElementId> |
| `ISet<ElementId> GetModifiedElementIds()` | `documentDifference.GetModifiedElementIds()` | ISet<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```